{
  "PROFESSIONAL_JOURNEY": {
    "en": "Professional Journey",
    "uk": "Професійний шлях",
    "ru": "Профессиональный путь"
  },
  "timeline": [
    {
      "date": {
        "en": "2025 (Jan) – Present",
        "uk": "2025 (січ.) – дотепер",
        "ru": "2025 (янв.) – настоящее время"
      },
      "title": {
        "en": "Cybersecurity Retainer & Incident Response Specialist",
        "uk": "Фахівець з кібербезпеки та реагування на інциденти",
        "ru": "Специалист по кибербезопасности и реагированию на инциденты"
      },
      "company": {
        "en": "Multiple US-based Clients (under NDA)",
        "uk": "Кілька клієнтів з США (NDA)",
        "ru": "Несколько клиентов из США (NDA)"
      },
      "description": {
        "en": "Providing ongoing cybersecurity coverage for six US-based organizations under retainer contracts. Perform monthly audits, infrastructure testing, and microservice threat modeling. Act as an emergency responder in case of attacks, conducting live mitigation, forensic analysis, and defensive hardening. Operate as the last line of defense — ensuring immediate reaction to active breaches and APT-like behavior.",
        "uk": "Надаю постійне покриття з кібербезпеки для шести компаній з США за контрактом на обслуговування. Виконую щомісячні перевірки, тестування інфраструктури та моделювання загроз для мікросервісів. Виступаю екстреним реагентом під час атак: нейтралізую, аналізую сліди, зміцнюю захист. Працюю як останній рубіж оборони — забезпечую миттєву реакцію на активні злами та поведінку рівня APT.",
        "ru": "Оказываю постоянную киберзащиту для шести компаний из США по контракту на удержание. Провожу ежемесячные аудиты, тестирование инфраструктуры и моделирование угроз для микросервисов. Выступаю в роли экстренного реагента при атаках: устраняю, анализирую, усиливаю защиту. Я — последний рубеж обороны: моментально реагирую на активные взломы и поведение уровня APT."
      }
    },
    {
      "date": {
        "en": "2024 (Dec) – 2025 (Jun)",
        "uk": "2024 (груд.) – 2025 (черв.)",
        "ru": "2024 (дек.) – 2025 (июнь)"
      },
      "title": {
        "en": "Full Stack Security Engineer",
        "uk": "Інженер з безпеки та повного стеку",
        "ru": "Инженер по безопасности и full stack"
      },
      "company": {
        "en": "Stealth Startup",
        "uk": "Стартап (секретно)",
        "ru": "Стартап (секретно)"
      },
      "description": {
        "en": "Designed and implemented the full security architecture of a real-time network monitoring platform. Built a Zero Trust backend infrastructure with encrypted WebSocket channels, role-based access control (RBAC), and service segmentation. Developed secure agents running in Docker, capable of sending isolated telemetry (CPU, RAM, ports, processes) over hardened protocols. Architected encrypted data flows, integrated multi-level user isolation, and enforced frontend-level access boundaries. Combined offensive knowledge with secure design to prevent MITM, injection, and access abuse.",
        "uk": "Спроєктував і реалізував повну архітектуру безпеки платформи моніторингу в реальному часі. Побудував Zero Trust бекенд із шифрованими WebSocket-каналами, рольовим доступом (RBAC) і сервісною ізоляцією. Розробив безпечні Docker-агенти, які передають ізольовану телеметрію (CPU, RAM, порти, процеси) через захищені протоколи. Побудував потоки зашифрованих даних, реалізував багаторівневу ізоляцію користувачів і захист на фронтенді. Поєднав знання атак з безпечним проєктуванням для протидії MITM, інʼєкціям і зловживанню правами.",
        "ru": "Спроектировал и реализовал полную архитектуру безопасности платформы мониторинга в реальном времени. Построил инфраструктуру Zero Trust с зашифрованными WebSocket-каналами, ролевым доступом (RBAC) и сервисной изоляцией. Разработал безопасные Docker-агенты, передающие изолированную телеметрию (CPU, RAM, порты, процессы) по защищённым протоколам. Организовал потоки зашифрованных данных, многоуровневую изоляцию пользователей и frontend-защиту. Совместил оффенсив-опыт с безопасным проектированием для защиты от MITM, инъекций и злоупотреблений."
      }
    },
    {
      "date": {
        "en": "2024 (Sep) – 2024 (Nov)",
        "uk": "2024 (вер.) – 2024 (лист.)",
        "ru": "2024 (сен.) – 2024 (ноя.)"
      },
      "title": {
        "en": "Blockchain Security Engineer",
        "uk": "Інженер безпеки блокчейну",
        "ru": "Инженер по безопасности блокчейна"
      },
      "company": {
        "en": "Web3 Security Group",
        "uk": "Web3 команда безпеки",
        "ru": "Web3 группа безопасности"
      },
      "description": {
        "en": "Worked as part of a high-intensity audit team targeting Solana-based systems in collaboration with a top-tier blockchain security partner. Over two months, tested 24 different projects, from token smart contracts to backend services. Discovered critical vulnerabilities including reentrancy, privilege escalation, traffic injection, and persistent backdoors. Delivered PoC exploits and hardened runtime logic through both manual and automated methods. Operated as an offensive security specialist leading a compact Red Team squad under NDA.",
        "uk": "Працював у складі інтенсивної Red Team-групи, яка займалася тестуванням Solana-проєктів у співпраці з провідним аудитором Web3. За два місяці перевірили 24 системи — від смарт-контрактів до бекендів. Виявлено критичні вразливості: reentrancy, ескалація привілеїв, інʼєкції в трафік і закладені бекдори. Створював PoC-експлойти та зміцнював захист на рівні коду та логіки. Працював як хакер, який очолює свою міні-команду під NDA.",
        "ru": "Работал в составе ударной Red Team, проводившей аудит Solana-проектов в сотрудничестве с ведущим Web3-аудитором. За два месяца протестировал 24 проекта: от токенов до серверных систем. Выявлены уязвимости: reentrancy, эскалация привилегий, внедрение в трафик, постоянные бэкдоры. Писал PoC-эксплойти, укреплял runtime-защиту. Работал как оффенсив-инженер, возглавляя собственную мини-команду под NDA."
      }
    },
    {
      "date": {
        "en": "2024 (Jun) – 2024 (Aug)",
        "uk": "2024 (черв.) – 2024 (серп.)",
        "ru": "2024 (июнь) – 2024 (авг.)"
      },
      "title": {
        "en": "Gameplay Engineer (AAA Horror Title)",
        "uk": "Інженер геймплею (AAA гра жахів)",
        "ru": "Инженер геймплея (AAA хоррор-игра)"
      },
      "company": {
        "en": "Stealth Studio",
        "uk": "Студія (секретно)",
        "ru": "Студия (секретно)"
      },
      "description": {
        "en": "Contributed to the development of an official expansion for a globally known asymmetrical horror title. Worked on quest and gameplay behavior for a Castlevania-inspired chapter, released as part of a major DLC. Used Unreal Engine 5 with Blueprints and C++ to script in-game logic, events, and character interactions. Participated in internal code reviews and collaborated with international teams under NDA.",
        "uk": "Брав участь у створенні офіційного доповнення для відомої асиметричної гри жахів. Працював над логікою завдань і геймплею для глави, натхненної Castlevania, яка вийшла у складі великого DLC. Використовував Unreal Engine 5, Blueprints і C++ для скриптингу логіки, подій та взаємодій. Співпрацював з міжнародною командою під NDA.",
        "ru": "Участвовал в разработке официального дополнения к глобально известной асимметричной хоррор-игре. Работал над поведением квестов и геймплея в главе, вдохновлённой Castlevania, которая вышла в составе крупного DLC. Использовал Unreal Engine 5, Blueprints и C++ для написания логики, событий и взаимодействий персонажей. Сотрудничал с международной командой в рамках NDA."
      }
    },
    {
      "date": {
        "en": "2024 (Jan) – 2024 (May)",
        "uk": "2024 (січ.) – 2024 (трав.)",
        "ru": "2024 (янв.) – 2024 (май)"
      },
      "title": {
        "en": "Mobile App Developer (iOS)",
        "uk": "Розробник мобільних додатків (iOS)",
        "ru": "Разработчик мобильных приложений (iOS)"
      },
      "company": {
        "en": "Stealth Startup",
        "uk": "Стартап (секретно)",
        "ru": "Стартап (секретно)"
      },
      "description": {
        "en": "Worked on a rapid-delivery iOS application under NDA. Focused on building the mobile data storage layer, optimizing memory use, and shaping the overall application architecture. Integrated external UI and logic modules from teammates into a cohesive app structure. Communication was mainly with the product lead, ensuring module compliance and delivery flow.",
        "uk": "Працював над NDA iOS-додатком із швидким релізом. Займався побудовою сховища даних, оптимізацією памʼяті та архітектурою мобільного застосунку. Інтегрував зовнішні модулі UI та логіки від інших учасників у єдину структуру. Спілкувався переважно з продакт-менеджером, забезпечуючи узгодженість модулів та хід розробки.",
        "ru": "Работал над NDA iOS-приложением с быстрым запуском. Отвечал за построение слоя хранения данных, оптимизацию памяти и общую архитектуру мобильного приложения. Интегрировал внешние модули UI и логики от других участников в единую структуру. Взаимодействовал в основном с продактом, контролируя соответствие модулей и ход сдачи."
      }
    },
    {
      "date": {
        "en": "2024 (Oct) – 2025 (Jun)",
        "uk": "2024 (жовт.) – 2025 (черв.)",
        "ru": "2024 (окт.) – 2025 (июнь)"
      },
      "title": {
        "en": "Enterprise Defense Architect",
        "uk": "Архітектор захисту підприємства",
        "ru": "Архитектор защиты предприятия"
      },
      "company": {
        "en": "Bank Infrastructure (under NDA)",
        "uk": "Інфраструктура банку (NDA)",
        "ru": "Инфраструктура банка (NDA)"
      },
      "description": {
        "en": "Led the security audit and hardening of a large-scale core banking system with 100+ microservices and legacy components. Assessed existing Zero Trust architecture, performed compliance gap analysis (PCI DSS, ISO 27001, NBU), and implemented major enhancements in threat detection, cryptographic infrastructure, and BCP/DR readiness. Integrated new container security policies, extended IAM and PAM coverage, and restructured SIEM pipelines for performance and forensic traceability. Delivered a full executive-level security report and coordinated incident simulations with internal and third-party teams.",
        "uk": "Керував аудитом і посиленням безпеки масштабної банківської системи з понад 100 мікросервісами та компонентами спадщини. Оцінив існуючу архітектуру Zero Trust, провів аналіз відповідності стандартам (PCI DSS, ISO 27001, НБУ) та впровадив поліпшення виявлення загроз, криптоінфраструктури та готовності до BCP/DR. Додав нові політики захисту контейнерів, розширив IAM і PAM, реорганізував потоки SIEM для продуктивності та трасування. Підготував повний звіт на рівні CISO та провів симуляції інцидентів з внутрішніми й зовнішніми командами.",
        "ru": "Руководил аудитом и усилением безопасности крупной банковской системы с более чем 100 микросервисами и легаси-компонентами. Оценил текущую Zero Trust-архитектуру, провёл анализ соответствия (PCI DSS, ISO 27001, НБУ), усилил системы обнаружения угроз, криптоинфраструктуру и готовность к BCP/DR. Внедрил политику контейнерной безопасности, расширил IAM/PAM, перестроил SIEM-пайплайны для скорости и отслеживаемости. Подготовил полный отчёт для руководства и провёл симуляции атак совместно с внешними подрядчиками."
      }
    },
    {
      "date": {
        "en": "2023 (Mar) – 2024 (Sep)",
        "uk": "2023 (бер.) – 2024 (вер.)",
        "ru": "2023 (мар.) – 2024 (сен.)"
      },
      "title": {
        "en": "Enterprise Security Architect",
        "uk": "Архітектор безпеки підприємства",
        "ru": "Архитектор корпоративной безопасности"
      },
      "company": {
        "en": "Major Digital Bank (under NDA)",
        "uk": "Цифровий банк (NDA)",
        "ru": "Цифровой банк (NDA)"
      },
      "description": {
        "en": "Designed and led the full security architecture for a top-tier digital banking platform. Built a multilayered Zero Trust infrastructure with over 70 integrated components including EDR, SIEM, PAM, IAM, DDoS, HSM, secure DevOps, and runtime cryptography. Architected secure communication layers, regulatory reporting chains, and containerized microservices for core banking, fraud detection, risk analytics, and AML compliance. Integrated real-time security orchestration (SOAR), user behavior analytics (UEBA), and dynamic threat response. Delivered full infrastructure-as-code with observability and automated audit trails. Collaborated directly with CISO and compliance officers to meet PCI DSS, ISO 27001, and national regulatory standards.",
        "uk": "Спроєктував і очолив повну архітектуру безпеки для провідної цифрової банківської платформи. Побудував багаторівневу інфраструктуру Zero Trust із понад 70 компонентів, включаючи EDR, SIEM, PAM, IAM, DDoS, HSM, secure DevOps та криптографію на рівні виконання. Розробив захищені шари комунікації, ланцюги регуляторної звітності та мікросервіси для core banking, виявлення шахрайства, аналітики ризиків та AML. Інтегрував SOAR, UEBA та динамічну відповідь на загрози. Реалізував повну інфраструктуру як код із моніторингом і аудитом. Працював безпосередньо з CISO та офіцерами з комплаєнсу відповідно до стандартів PCI DSS, ISO 27001 та національних вимог.",
        "ru": "Спроектировал и возглавил архитектуру безопасности для ведущей цифровой банковской платформы. Построил многослойную Zero Trust-инфраструктуру с более чем 70 компонентами, включая EDR, SIEM, PAM, IAM, DDoS-защиту, HSM, secure DevOps и криптографию на уровне исполнения. Реализовал защищённые коммуникации, цепочки регуляторной отчётности и микросервисы для core banking, антифрода, риск-аналитики и AML. Интегрировал SOAR, UEBA и динамическое реагирование на угрозы. Автоматизировал инфраструктуру как код с полным мониторингом и логированием. Работал напрямую с CISO и офицерами комплаенса под стандарты PCI DSS, ISO 27001 и национальные регуляторы."
      }
    },
    {
      "date": {
        "en": "2023 (Jan) – 2024 (Jan)",
        "uk": "2023 (січ.) – 2024 (січ.)",
        "ru": "2023 (янв.) – 2024 (янв.)"
      },
      "title": {
        "en": "Red Team Lead & Offensive Security Engineer",
        "uk": "Керівник Red Team та інженер з атакуючої безпеки",
        "ru": "Лидер Red Team и специалист по атакующей безопасности"
      },
      "company": {
        "en": "FortiNet",
        "uk": "FortiNet",
        "ru": "FortiNet"
      },
      "description": {
        "en": "Joined as a junior analyst and grew into Red Team Lead within 3 months. Spearheaded offensive security operations, including in-depth penetration testing, reverse engineering, social engineering, and traffic analysis using Wireshark. Designed red team strategies, audited complex infrastructures, and studied real-world attack vectors using custom C++ socket payloads and Python-based network probes. Explored low-level security with assembly and disassemblers. Led a tight-knit 7-person team through highly impactful test engagements.",
        "uk": "Почав як молодший аналітик та за 3 місяці виріс до керівника Red Team. Керував атаками на інфраструктуру, включно з глибоким пентестингом, реверс-інжинірингом, соціальною інженерією та аналізом трафіку через Wireshark. Створював стратегії Red Team, проводив аудити складних інфраструктур, досліджував реальні вектори атак з використанням кастомних payload на C++ та Python-сканерів. Освоїв асемблер та дизасемблювання. Очолював згуртовану команду з 7 осіб у потужних тестуваннях.",
        "ru": "Начал как младший аналитик и за 3 месяца стал лидером Red Team. Руководил атаками на инфраструктуру, включая глубокий пентестинг, реверс-инжиниринг, социальную инженерию и анализ трафика через Wireshark. Разрабатывал стратегии Red Team, проводил аудит сложных инфраструктур, изучал реальные векторы атак, используя кастомные payload'ы на C++ и сетевые сканеры на Python. Освоил ассемблер и дизассемблирование. Возглавлял сплочённую команду из 7 человек на мощных проектах."
      }
    },
    {
      "date": {
        "en": "2021 (Oct) – 2022 (Dec)",
        "uk": "2021 (жовт.) – 2022 (груд.)",
        "ru": "2021 (окт.) – 2022 (дек.)"
      },
      "title": {
        "en": "Full Stack Developer",
        "uk": "Full Stack розробник",
        "ru": "Full Stack разработчик"
      },
      "company": {
        "en": "PerfectLine",
        "uk": "PerfectLine",
        "ru": "PerfectLine"
      },
      "description": {
        "en": "Joined as a junior and quickly gained responsibility over core backend and frontend modules. Built modular systems using Java Spring and Python frameworks. Developed web interfaces with Angular and containerized environments via Docker. In the final months, initiated secure Docker architecture and wrote internal documentation on safe deployments — marking the beginning of my transition into security.",
        "uk": "Почав як джуніор і швидко отримав відповідальність за ключові бекенд і фронтенд модулі. Побудував модульну систему на Java Spring та Python фреймворках. Розробляв веб-інтерфейси з Angular і контейнеризовані середовища через Docker. В останні місяці ініціював побудову безпечної Docker-архітектури та написав внутрішню документацію по захищеному розгортанню — це стало стартом мого переходу в сферу безпеки.",
        "ru": "Начал как джуниор и быстро получил ответственность за ключевые backend и frontend модули. Построил модульную систему на Java Spring и Python-фреймворках. Разрабатывал веб-интерфейсы с использованием Angular и контейнеризовал окружения через Docker. В последние месяцы начал внедрять защищённую Docker-архитектуру и писал внутреннюю документацию по безопасному развёртыванию — с этого начался мой переход в сферу безопасности."
      }
    }
  ]
}
