{
  "PROFESSIONAL_JOURNEY": {
    "en": "Professional Journey",
    "uk": "Професійний шлях",
    "ru": "Профессиональный путь"
  },
  "timeline": [
    {
      "date": {
        "en": "2025 (May) – 2025 (Oct)",
        "uk": "2025 (трав.) – 2025 (жовт.)",
        "ru": "2025 (май) – 2025 (окт.)"
      },
      "title": {
        "en": "Python Developer",
        "uk": "Python розробник",
        "ru": "Python разработчик"
      },
      "company": {
        "en": "EON PLUS",
        "uk": "EON PLUS",
        "ru": "EON PLUS"
      },
      "description": {
        "en": "Built and maintained a containerized microservice platform using Python and FastAPI for an enterprise client. Implemented the backend for an AI consultation chat with a vector database. Delivered a document-flow service for secure processing, signing, and storage, including integration with the national Diia e-signature platform. Built a notifications service with Telegram bots, TurboSMS, and SMTP2Go for async alerts. Developed the finance microservice API, maintained OpenAPI specs (auto-generated and custom with $ref), and operated Docker-based deployments.",
        "uk": "Побудував і підтримував контейнеризовану мікросервісну платформу на Python і FastAPI для корпоративного клієнта. Реалізував бекенд AI‑чату з векторною БД. Створив сервіс документообігу для безпечної обробки, підпису та зберігання, включно з інтеграцією з державною платформою Дія для електронного підпису. Розробив сервіс сповіщень із Telegram, TurboSMS та SMTP2Go для асинхронних повідомлень. Розробив фінансовий API, підтримував OpenAPI‑специфікації (авто та кастомні з $ref) і забезпечував розгортання в Docker.",
        "ru": "Построил и поддерживал контейнеризованную микросервисную платформу на Python и FastAPI для корпоративного клиента. Реализовал backend AI‑чата с векторной БД. Создал сервис документооборота для безопасной обработки, подписания и хранения, включая интеграцию с государственной платформой Дія для электронной подписи. Разработал сервис уведомлений с Telegram, TurboSMS и SMTP2Go для асинхронных оповещений. Разработал финансовый API, поддерживал OpenAPI‑спецификации (авто и кастомные с $ref) и обеспечивал деплой в Docker."
      }
    },
    {
      "date": {
        "en": "2025 (Jan) – 2025 (Oct)",
        "uk": "2025 (січ.) – 2025 (жовт.)",
        "ru": "2025 (янв.) – 2025 (окт.)"
      },
      "title": {
        "en": "Senior Software Engineer (Security Automation)",
        "uk": "Senior Software Engineer (Security Automation)",
        "ru": "Senior Software Engineer (Security Automation)"
      },
      "company": {
        "en": "Multiple US-based Clients (under NDA)",
        "uk": "Кілька клієнтів зі США (NDA)",
        "ru": "Несколько клиентов из США (NDA)"
      },
      "description": {
        "en": "Architected and maintained a proprietary automation framework of 15+ utilities in Go, Python, and Rust. The framework automates most audit, forensic, and hardening workflows, cutting manual time drastically. Built modules for infrastructure testing, microservice threat modeling, and incident mitigation, and integrated AI components for structured reports. Served as the escalation point during active incidents and supervised framework-driven response.",
        "uk": "Спроєктував і підтримував пропрієтарний фреймворк автоматизації з 15+ утиліт на Go, Python і Rust. Фреймворк автоматизує більшість аудитів, форензіки та hardening‑процесів, радикально зменшуючи ручну роботу. Побудував модулі для тестування інфраструктури, моделювання загроз для мікросервісів і реагування на інциденти, інтегрував AI‑компоненти для структурованих звітів. Виконував роль ескалації під час активних інцидентів і контролював автоматизовану відповідь.",
        "ru": "Спроектировал и поддерживал проприетарный фреймворк автоматизации из 15+ утилит на Go, Python и Rust. Фреймворк автоматизирует большую часть аудитов, форензики и hardening‑процессов, резко сокращая ручной труд. Построил модули для тестирования инфраструктуры, моделирования угроз микросервисов и реагирования на инциденты, интегрировал AI‑компоненты для структурированных отчетов. Выступал точкой эскалации во время активных инцидентов и контролировал автоматизированную реакцию."
      }
    },
    {
      "date": {
        "en": "2024 (Dec) – 2025 (Jun)",
        "uk": "2024 (груд.) – 2025 (черв.)",
        "ru": "2024 (дек.) – 2025 (июнь)"
      },
      "title": {
        "en": "Full Stack Security Engineer",
        "uk": "Інженер з безпеки та full stack",
        "ru": "Инженер по безопасности и full stack"
      },
      "company": {
        "en": "Stealth Startup (under NDA)",
        "uk": "Стартап (NDA)",
        "ru": "Стартап (NDA)"
      },
      "description": {
        "en": "Built the backend for a real‑time network monitoring platform. Implemented a Zero Trust architecture with Go (Gin) WebSocket channels, Python (FastAPI) analytics, and Java (Spring Boot) enterprise services. Developed secure Go/Rust agents for containerized telemetry, enforced RBAC and multi‑tenant isolation, and engineered encrypted data flows end‑to‑end.",
        "uk": "Побудував бекенд платформи моніторингу в реальному часі. Реалізував Zero Trust архітектуру з Go (Gin) WebSocket‑каналами, Python (FastAPI) аналітикою та Java (Spring Boot) сервісами enterprise‑класу. Розробив безпечні агенти на Go/Rust для контейнеризованої телеметрії, впровадив RBAC і мульти‑тенантну ізоляцію, реалізував шифровані потоки даних end‑to‑end.",
        "ru": "Построил backend платформы мониторинга в реальном времени. Реализовал Zero Trust архитектуру с Go (Gin) WebSocket‑каналами, аналитикой на Python (FastAPI) и сервисами на Java (Spring Boot). Разработал безопасные Go/Rust агенты для контейнеризованной телеметрии, внедрил RBAC и изоляцию арендаторов, обеспечил шифрованные потоки данных end‑to‑end."
      }
    },
    {
      "date": {
        "en": "2024 (Oct) – 2025 (Jun)",
        "uk": "2024 (жовт.) – 2025 (черв.)",
        "ru": "2024 (окт.) – 2025 (июнь)"
      },
      "title": {
        "en": "Enterprise Defense Architect",
        "uk": "Архітектор захисту підприємства",
        "ru": "Архитектор защиты предприятия"
      },
      "company": {
        "en": "Bank Infrastructure (under NDA)",
        "uk": "Інфраструктура банку (NDA)",
        "ru": "Инфраструктура банка (NDA)"
      },
      "description": {
        "en": "Led engineering work to secure a core banking system with 100+ microservices and legacy components. Developed and deployed secure Go/Java services, hardened existing systems, and built TeamCity CI/CD pipelines for container scanning and delivery (including custom Rust scanners). Implemented compliance‑driven changes for PCI DSS, ISO 27001, and NBU, and optimized SIEM pipelines for high‑volume logging and forensic traceability.",
        "uk": "Керував інженерною роботою з захисту core‑банкінгу з 100+ мікросервісами та legacy‑компонентами. Розробляв і впроваджував безпечні Go/Java сервіси, посилював наявні системи та будував CI/CD у TeamCity для сканування контейнерів і деплою (з кастомним Rust‑сканером). Реалізував зміни під PCI DSS, ISO 27001 та НБУ і оптимізував SIEM‑пайплайни для високого навантаження й форензічної трасованості.",
        "ru": "Руководил инженерной работой по защите core‑банкинга с 100+ микросервисами и legacy‑компонентами. Разрабатывал и внедрял безопасные Go/Java сервисы, усиливал существующие системы и строил CI/CD в TeamCity для сканирования контейнеров и деплоя (с кастомными Rust‑сканерами). Реализовал изменения под PCI DSS, ISO 27001 и НБУ, оптимизировал SIEM‑пайплайны для высокой нагрузки и форензической трассируемости."
      }
    },
    {
      "date": {
        "en": "2024 (Sep) – 2024 (Nov)",
        "uk": "2024 (вер.) – 2024 (лист.)",
        "ru": "2024 (сен.) – 2024 (ноя.)"
      },
      "title": {
        "en": "Blockchain Security Tools Developer (R&D)",
        "uk": "Розробник інструментів безпеки блокчейну (R&D)",
        "ru": "Разработчик инструментов безопасности блокчейна (R&D)"
      },
      "company": {
        "en": "Web3 Security Group (under NDA)",
        "uk": "Web3 Security Group (NDA)",
        "ru": "Web3 Security Group (NDA)"
      },
      "description": {
        "en": "Performed security audits for Solana‑based projects and started R&D on an automation toolkit to reduce manual audit effort. Built early versions of a framework in Python, Go, and Rust that detects reentrancy, privilege escalation, and injection patterns. This research laid the foundation for a toolset that later automated most audit workflows.",
        "uk": "Проводив аудити безпеки Solana‑проєктів і запустив R&D для автоматизації аудиту. Створив перші версії фреймворку на Python, Go та Rust для виявлення reentrancy, ескалації привілеїв і інʼєкцій. Дослідження стало основою набору інструментів, який згодом автоматизував більшість аудиторських процесів.",
        "ru": "Проводил аудиты безопасности Solana‑проектов и запустил R&D по автоматизации аудита. Создал ранние версии фреймворка на Python, Go и Rust для обнаружения reentrancy, эскалации привилегий и инъекций. Исследование стало основой набора инструментов, который позже автоматизировал большую часть аудиторских процессов."
      }
    },
    {
      "date": {
        "en": "2024 (Jun) – 2024 (Aug)",
        "uk": "2024 (черв.) – 2024 (серп.)",
        "ru": "2024 (июнь) – 2024 (авг.)"
      },
      "title": {
        "en": "Gameplay Engineer (AAA Horror Title)",
        "uk": "Інженер геймплею (AAA хоррор‑проєкт)",
        "ru": "Инженер геймплея (AAA хоррор‑проект)"
      },
      "company": {
        "en": "Stealth Studio (under NDA)",
        "uk": "Stealth Studio (NDA)",
        "ru": "Stealth Studio (NDA)"
      },
      "description": {
        "en": "Contributed to an official expansion for a globally known AAA horror title. Scripted gameplay logic, quests, and character interactions using Unreal Engine 5 (C++ and Blueprints). Participated in internal code reviews and collaborated with international teams under NDA.",
        "uk": "Працював над офіційним доповненням до відомого AAA‑хоррор‑тайтлу. Скриптував ігрову логіку, квести й взаємодії персонажів в Unreal Engine 5 (C++ і Blueprints). Брав участь у внутрішніх code‑review та співпрацював з міжнародними командами під NDA.",
        "ru": "Работал над официальным дополнением к известному AAA‑хоррор‑тайтлу. Скриптовал игровую логику, квесты и взаимодействия персонажей в Unreal Engine 5 (C++ и Blueprints). Участвовал во внутренних code‑review и взаимодействовал с международными командами под NDA."
      }
    },
    {
      "date": {
        "en": "2024 (Jan) – 2024 (May)",
        "uk": "2024 (січ.) – 2024 (трав.)",
        "ru": "2024 (янв.) – 2024 (май)"
      },
      "title": {
        "en": "Mobile App Developer (iOS)",
        "uk": "Розробник мобільних додатків (iOS)",
        "ru": "Разработчик мобильных приложений (iOS)"
      },
      "company": {
        "en": "Stealth Startup (under NDA)",
        "uk": "Стартап (NDA)",
        "ru": "Стартап (NDA)"
      },
      "description": {
        "en": "Engineered the mobile data storage layer for a rapid‑delivery iOS app. Focused on architecture design, memory optimization, and stable module integration. Collaborated closely with the product lead to ensure delivery flow and technical alignment.",
        "uk": "Побудував шар зберігання даних для iOS‑додатку зі швидким релізом. Фокус на архітектурі, оптимізації памʼяті та стабільній інтеграції модулів. Працював напряму з продакт‑лідом для узгодження технічного напрямку й темпу доставки.",
        "ru": "Построил слой хранения данных для iOS‑приложения с быстрым релизом. Сфокусировался на архитектуре, оптимизации памяти и устойчивой интеграции модулей. Работал напрямую с продакт‑лидом для согласования технического направления и скорости поставки."
      }
    },
    {
      "date": {
        "en": "2023 (Mar) – 2023 (Sep)",
        "uk": "2023 (бер.) – 2023 (вер.)",
        "ru": "2023 (мар.) – 2023 (сен.)"
      },
      "title": {
        "en": "Lead Backend Engineer (Infrastructure)",
        "uk": "Lead Backend Engineer (Infrastructure)",
        "ru": "Lead Backend Engineer (Infrastructure)"
      },
      "company": {
        "en": "Major Digital Bank (under NDA)",
        "uk": "Цифровий банк (NDA)",
        "ru": "Цифровой банк (NDA)"
      },
      "description": {
        "en": "Led backend development for a secure digital banking platform. Designed and delivered Go/Java microservices for core banking, fraud detection, and AML compliance. Implemented infrastructure‑as‑code with audit trails and observability. Integrated a multi‑layer Zero Trust stack across 70+ components (EDR, SIEM, PAM, IAM, HSM, SOAR/UEBA) to ensure secure operations at scale.",
        "uk": "Очолив бекенд‑розробку безпечної цифрової банківської платформи. Спроєктував і реалізував Go/Java мікросервіси для core banking, антифроду та AML. Впровадив infrastructure‑as‑code з аудит‑трейлами та observability. Інтегрував багаторівневий Zero Trust стек із 70+ компонентів (EDR, SIEM, PAM, IAM, HSM, SOAR/UEBA) для стабільної безпеки в масштабі.",
        "ru": "Возглавил backend‑разработку безопасной цифровой банковской платформы. Спроектировал и реализовал Go/Java микросервисы для core banking, антифрода и AML. Внедрил infrastructure‑as‑code с аудит‑трейлами и observability. Интегрировал многоуровневый Zero Trust стек из 70+ компонентов (EDR, SIEM, PAM, IAM, HSM, SOAR/UEBA) для надежной безопасности в масштабе."
      }
    },
    {
      "date": {
        "en": "2023 (Jan) – 2024 (Jan)",
        "uk": "2023 (січ.) – 2024 (січ.)",
        "ru": "2023 (янв.) – 2024 (янв.)"
      },
      "title": {
        "en": "Red Team Lead & Offensive Security Engineer",
        "uk": "Керівник Red Team та інженер атакуючої безпеки",
        "ru": "Лидер Red Team и инженер атакующей безопасности"
      },
      "company": {
        "en": "FortiNet",
        "uk": "FortiNet",
        "ru": "FortiNet"
      },
      "description": {
        "en": "Promoted from junior analyst to Red Team lead in three months. Developed low‑level security tooling in C++ and Python for network simulation and automated infrastructure analysis. Led penetration testing engagements and reverse engineering tasks, applying findings to harden systems and improve secure software design.",
        "uk": "За три місяці виріс із junior‑аналітика до лідера Red Team. Розробляв низькорівневі інструменти безпеки на C++ і Python для симуляції мережі та автоматичного аналізу інфраструктури. Керував пентест‑проєктами й задачами реверсу, використовуючи результати для посилення систем і поліпшення безпечного дизайну ПЗ.",
        "ru": "За три месяца вырос из junior‑аналитика до лидера Red Team. Разрабатывал низкоуровневые инструменты безопасности на C++ и Python для симуляции сети и автоматизированного анализа инфраструктуры. Руководил пентест‑проектами и задачами реверса, применяя результаты для усиления систем и улучшения безопасного дизайна ПО."
      }
    },
    {
      "date": {
        "en": "2021 (Oct) – 2022 (Dec)",
        "uk": "2021 (жовт.) – 2022 (груд.)",
        "ru": "2021 (окт.) – 2022 (дек.)"
      },
      "title": {
        "en": "Full Stack Developer",
        "uk": "Full Stack розробник",
        "ru": "Full Stack разработчик"
      },
      "company": {
        "en": "PerfectLine",
        "uk": "PerfectLine",
        "ru": "PerfectLine"
      },
      "description": {
        "en": "Grew from junior to owning key backend and frontend modules. Built modular services with Java (Spring Boot) and Python (FastAPI/Flask), developed Angular interfaces, and containerized deployments with Docker. Introduced secure container architecture patterns and internal deployment guidelines.",
        "uk": "Виріс із junior до відповідальності за ключові бекенд і фронтенд модулі. Будував модульні сервіси на Java (Spring Boot) і Python (FastAPI/Flask), розробляв Angular‑інтерфейси та контейнеризував деплой у Docker. Запровадив патерни безпечної контейнерної архітектури й внутрішні гайди з деплою.",
        "ru": "Вырос из junior до ответственности за ключевые backend и frontend модули. Строил модульные сервисы на Java (Spring Boot) и Python (FastAPI/Flask), разрабатывал Angular‑интерфейсы и контейнеризовал деплой через Docker. Внедрил паттерны безопасной контейнерной архитектуры и внутренние гайды по деплою."
      }
    },
    {
      "date": {
        "en": "2019 (Nov) – 2021 (Sep)",
        "uk": "2019 (лист.) – 2021 (вер.)",
        "ru": "2019 (ноя.) – 2021 (сен.)"
      },
      "title": {
        "en": "Software Developer (Trainee / Junior)",
        "uk": "Розробник ПЗ (Trainee / Junior)",
        "ru": "Разработчик ПО (Trainee / Junior)"
      },
      "company": {
        "en": "Stealth Company (under NDA)",
        "uk": "Stealth Company (NDA)",
        "ru": "Stealth Company (NDA)"
      },
      "description": {
        "en": "Built foundational backend skills in a professional R&D environment. Worked extensively with Python and Java, improving core engineering practices, code quality, and delivery discipline.",
        "uk": "Отримав базовий комерційний досвід у бекенд‑розробці в R&D‑середовищі. Багато працював із Python і Java, покращуючи інженерні практики, якість коду та дисципліну доставки.",
        "ru": "Получил базовый коммерческий опыт в backend‑разработке в R&D‑среде. Много работал с Python и Java, улучшая инженерные практики, качество кода и дисциплину поставки."
      }
    }
  ]
}
